export const PRIVACY_CONTENT = `

## 個人情報取り扱いに関する基本方針

リアル大学生（以下、「当サイト」と言います。）では、ご利用頂くお客様の個人情報を適切に保護するため、個人情報の保護に関する法律、その他の関係法令を遵守すると共に、以下に定めるプライバシーポリシーに従って、個人情報を安全かつ適切に取り扱うことを宣言いたします。

## 個人情報の定義

「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ、及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。

## 個人情報の取得方法

当サイトはユーザーが利用登録をする際に氏名、住所、電話番号、メールアドレス、などの個人情報をお尋ねすることがあります。また、ユーザーと提携先などとの間でなされたユーザーの個人情報を含む取引記録や決済に関する情報を、当サイトの提携先（情報提供元、広告主、広告配信先などを含みます。以下、｢提携先｣といいます。）などから収集することがあります。

### クッキー（Cookie）

当サイトでは、アクセス解析サービス、各種アフィリエイトプログラム、広告配信サービスを利用しております。これらの広告配信業者は、ユーザーのご興味に応じた商品やサービスの広告を表示するため、ユーザーの当サイトおよび他サイトへのアクセスに関する情報Cookieを使用することがございます。

Cookieは、ユーザーが当サイトあるいは他サイトを閲覧された際、使用されたコンピューターやデバイス内に記録されます。ただし、この情報には、お名前・ご住所・メールアドレス・電話番号など個人を特定できるものは一切含まれません。

Cookieによる情報収集を好まれない場合、ユーザーご自身でブラウザで受け入れを拒否するよう設定することも可能です。ただし、この設定により一部のコンテンツが正しく機能しない場合、またサービスが受けられない場合がございます。あらかじめご了承ください。

なお、設定方法に関しては[Googleポリシーと規約](https://policies.google.com/technologies/partner-sites?hl=ja)にてご確認いただけます。

### アクセス解析ツール

当サイトでは、Googleの提供するアクセス解析ツール『Google Analytics』を使用しています。Google Analyticsはトラフィックデータの収集のためCookieを利用します。このトラフィックデータは匿名で収集されており、個人を特定するものではございません。

ユーザーは、Cookieを無効化することにより、データの収集を拒否することができます。お使いのブラウザより設定をご確認ください。

なお、この規約に関しては、[Googleアナリティクス利用規約](https://marketingplatform.google.com/about/analytics/terms/jp/)および[Googleポリシーと規約](https://policies.google.com/technologies/partner-sites?hl=ja)でご確認いただけます。

### コメントについて

当ブログへのコメントを残す際に、IP アドレスを収集しています。

これはブログの標準機能としてサポートされている機能で、スパムや荒らしへの対応以外にこのIPアドレスを使用することはありません。

なお、全てのコメントは管理人が事前にその内容を確認し、承認した上での掲載となります。あらかじめご了承ください。

## 個人情報の利用目的

当サイトが個人情報を収集・利用する目的は、以下のとおりです。

当サイトのお問い合わせ際に、名前（ニックネーム）、メールアドレス等の個人情報を入力いただく場合がございます。

これらの個人情報は、質問に対する回答や必要な情報を電子メールなどでご連絡する場合に利用させていただくものであり、個人情報をご提供いただく際の目的以外では利用いたしません。

当サイトでは，有料のサービスを提供しております。その際の利用料金のご請求をするために利用しております。

その他に、当サイトを不正・不当な目的で利用しようとするユーザーがいた場合、ユーザーの特定をし、ご利用をお断りするために利用します。

## 当サイトが利用している広告サービス

当サイトは、以下の第三者の配信する広告サービスならびにアフィリエイトプログラムを利用しております。

- もしもアフィリエイト
- レントラックスアフィリエイト

これらのサービスにおいて取得・収集される情報については、各プログラムのプライバシーポリシーにてご確認ください。

### Amazonアソシエイトプログラム

Amazonのアソシエイトとして、当メディアは適格販売により収入を得ています。

### Google AdSense

当サイトは、第三者配信の広告サービス「Google AdSense（グーグルアドセンス）」を利用しています。当サイトにおいて広告が配信される過程で、Cookieやデバイス特有の情報、位置情報、当該デバイスから収集されるその他の情報が利用される場合があります。ただしその過程で個人を特定できる情報は収集されません。

また、Google AdSenseに関して、このプロセスの詳細や情報が広告配信事業者に使用されないよう、ユーザーご自身で設定することができます。ただし、この設定により一部のコンテンツが正しく機能しない場合、またサービスが受けられない場合がございます。あらかじめご了承ください。

なお、この設定方法に関しては[Googleポリシーと規約](https://policies.google.com/technologies/partner-sites?hl=ja)にてご確認いただけます。

## 個人情報の管理方法

当サイトは第三者に皆さまの重要な情報を読み取られたり、改ざんされたりすることを防ぐために、SSLを使用しております。

SSL(SecureSocketLayer)とはデータを暗号化して通信するセキュリティ機能です。
SSLで暗号化することによってお客さまの個人情報をハッカーやクラッカーから守り、安全に情報を送信することができます。

## 個人情報の第三者提供

当サイトは次に掲げる場合を除いて、あらかじめユーザーの同意を得ることなく第三者に個人情報を提供することはありません。

ただし、個人情報保護法その他の法令で認められる場合を除きます。

## 個人情報の開示、訂正などの手続きについて

ご本人からの個人情報の開示、訂正、追加、削除、利用停止のご希望の場合には、ご本人であることを確認させて頂いた上、速やかに対応させていただきます。

## 個人情報の取扱いに関する相談や苦情の連絡先

本ポリシーに関するお問い合わせは、下記の窓口までお願いいたします。

サイト運営者：Arata1202

連絡先：[お問い合わせ](/contact)

`;
