export const ProfileContent = `

初めまして、現役大学生のあらたと申します。

「プログラミングを勉強する大学生」をテーマにブログを始めました。

大学では経営やマーケティングを学びつつ、独学でプログラミングを学び、エンジニアの長期インターンシップに参加しています。現在も継続してスキルアップを図っています

同じように未経験からエンジニアを目指している方々も多いと思います。このブログでは、現役大学生の私が独学で習得したプログラミングの知識や大学生活の情報を共有していきます。

どうぞよろしくお願いいたします。

## ブログ始めたきっかけ

まだまだ大学3年生ですが、様々な経験をしてきました。社会人になる一歩手前ということもあり、挑戦できることの幅も増え、運転免許を取得したり、アルバイトを始めたり、将来の夢に向けて勉強したりなど、やらなければならない事がたくさん増えました。

そんな中、自分なりに解決法を探しながら生活してきました。それらの経験を無駄にせず、同じ気持ちを抱く大学生の方々に共有したいと考え、ブログを始めました。

## プロフィール

筆者の活動や趣味についてご紹介します。

### 筆者について

- 年齢｜21歳
- 在住｜千葉県
- 大学生｜東洋大学 経営学部 マーケティング学科
- インターン｜Webエンジニア（長期）
- 趣味｜旅行、ドライブ、ゲーム、プログラミングなどなど

#### 大学

大学では経営学部のマーケティング学科に所属し、ゼミでは消費者行動の研究や企業の成長戦略について議論しています。

#### インターンシップ

都内の企業でWebメディアやCMSの開発を行っています。また、外部企業からの案件も手掛けています。

使用している技術は、Vue.js、Laravel、Next.jsなどです。

#### 旅行

とにかく旅行が大好きです。飛行機や電車、車などあらゆる手段を使って旅行しています。特に温泉地に行くのが好きなので、東北旅行なども好きだったりします。

青春18切符やJALのスカイメイトを利用したりなど、自称ではありますが、普通よりは旅行知識があるのではないかと思っています（笑）。

Instagramでは、主に旅行について紹介しています。興味のある方はぜひご覧ください。

[Instagram](https://www.instagram.com/ao_realstudent/)

#### ゲーム

最近はあまりしていませんが、ゲームも好きです。SwitchとゲーミングPCを持っており、休日にたまに遊んでいます。

FPSゲームが特に好きで、APEXやスプラトゥーンをよくプレイしています。

#### プログラミング

去年始めたプログラミングにすっかりハマり、趣味の一つになりました。このブログも自分で作成しました。

## 技術スタック

筆者は以下の技術をよく使用しています。

- フロントエンド｜React, Next.js, Vue.js, TypeScript, TailwindCSS
- バックエンド｜PHP, Laravel
- データベース｜MySQL
- ホスティング｜Vercel, AWS
- ツール｜GitHub, Docker

インターンではVue.jsとLaravel、個人開発ではReactやNext.js, PHPの使用頻度が高いです。

## 当ブログ（リアル大学生）の使用技術

当ブログ（リアル大学生）は以下の構成で、運営しています。

- フロントエンド｜Next.js, TypeScript, TailwindCSS
- ツール｜MicroCMS, GitHub
- ホスティング｜Vercel
- バックエンド｜AWS Lambda

## お問い合わせ

お問い合わせの際は、下記の窓口からお願いいたします。

サイト運営者：あらた

連絡先：[お問い合わせ](/contact)

`;
